class Hadith {
  final String title;
  final String text;
  Hadith({required this.title, required this.text});
}

final List<Hadith> hadithList = [
  Hadith(
    title: 'الحديـث الأول',
    text:
        '''عن أمير المؤمنين أبي حفص عمر بن الخطاب رضي الله عنه، قال : سمعت رسول الله صلى الله عليه وسلم يقول :
( إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى . فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها أو امرأة ينكحها فهجرته إلى ما هاجر إليه )
رواه إمام المحدثين أبو عبد الله محمد بن إسماعيل بن إبراهيم بن المغيرة بن برد زبه البخاري الجعفي[رقم:1] وأبو الحسين مسلم بن الحجاج بن مسلم القشيري النيسابوري [رقم: 1907] رضي الله عنهما في صحيحهما الذين هما أصح الكتب المصنفة.''',
  ),
  Hadith(
    title: 'الحديـث الثاني',
    text:
        '''عن أمير المؤمنين أبي حفص عمر بن الخطاب رضي الله عنه، قال : سمعت رسول الله صلى الله عليه وسلم يقول :
( إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى . فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها أو امرأة ينكحها فهجرته إلى ما هاجر إليه )
رواه إمام المحدثين أبو عبد الله محمد بن إسماعيل بن إبراهيم بن المغيرة بن برد زبه البخاري الجعفي[رقم:1] وأبو الحسين مسلم بن الحجاج بن مسلم القشيري النيسابوري [رقم: 1907] رضي الله عنهما في صحيحهما الذين هما أصح الكتب المصنفة.''',
  ),
  // Add more hadiths here as needed
];
